lx_common_phrases: dict[str, str] = {
    'start_text': '🤝Здравствуйте! Мы рады видеть вас в нашем приложении. 🌟 '
                  'Пожалуйста, выберите, являетесь ли вы исполнителем '
                  'или заказчиком в нашей системе. Выберите вариант, который '
                  'соответствует вашей роли, чтобы мы могли предоставить '
                  'вам наилучший опыт использования нашего сервиса. 🙌',
    'enter_name': 'Пожалуйста, укажи своё имя и фамилию',
    'choice_specializations': 'Пожалуйста, выберите свою специализацию',
    'cancel_choice': 'Вы отменили регистрацию в приложении.\n'
                     'Для повторной регистрации введите команду \\start',
    'creating_profile': '✅Профиль успешно создан',
}

LEXICON_RU: dict[str, str] = {
    'performer': '🛠Исполнитель',
    'customer': '👨‍💼Заказчик',
    'cancel': '❌Отмена',
    'porter': '📦Грузчик',
    'electrician': '🔌Электрик',
    'plumber': '🚽Сантехник',
    'it-professional': '🖥️Ит-специалист',
    'cleaner': '🪠Уборщик',
    'profile': '👤Профиль',
    'my_orders': '📋Мои заказы',
    'search_orders': '📑Поиск заказов',
    'change_status': '🔄Изменить статус',
    'add_order': '➕Создать заказ',
}
