lx_common_phrases: dict[str, str] = {
    'start_text': '🤝Здравствуйте! Мы рады видеть вас в нашем приложении. 🌟 '
                  'Пожалуйста, выберите, являетесь ли вы исполнителем '
                  'или заказчиком в нашей системе. Выберите вариант, который '
                  'соответствует вашей роли, чтобы мы могли предоставить '
                  'вам наилучший опыт использования нашего сервиса. 🙌',
    'enter_name': 'Пожалуйста, укажи своё имя и фамилию',
    'choice_specializations': 'Пожалуйста, выберите свою специализацию',
    'cancel_choice': 'Вы отменили регистрацию в приложении.\n'
                     'Для повторной регистрации введите команду \\start',
    'creating_profile': '✅Профиль успешно создан',
    'location': '📍Напишите адрес выполнения заказа',
    'cancel_order ': '❌Вы отменили создание заказа',
    'date_order': '📆Выберите дату выполнения заказа',
    'check_day': '📆Выберите число⬇️',
    'check_month': '📆Выберите месяц⬇️',
    'check_year': '📆Выберите год⬇️',
    'check_time': '⌚️Выберите время начала работ⬇️',
    'check_hour': '⌚️Выберите час начала работ⬇️',
    'check_minutes': '⌚️Выберите минуты начала работ⬇️',
    'check_specializations': '🧑‍🔧Выберите специализацию рабочих⬇️',
    'count_workers': 'Напишите необходимое количество рабочих⬇️',
    'price_order': 'Введите сумму оплаты за заказ⬇️',
    'desc_order': 'Кратко опиши какие работы необходимо выполнить⬇️\n\n'
                  '<i>Максимально допустимое число символов 256</i>',
    'order_create': '✅Заказ успешно создан\n'
                    '🕒Через 3 часа будут выбраны исполнители',
    'accept_order': '✅Принять',
    'reject_order': '❌Отклонить',
    'choice_order': '✅Вы приняли заказ!',
    'info_order': '🗒К заказу',
    'my_order': '⬇️Выши заказы⬇️',
    'status_order_search': '🔎В поиске исполнителей',
    'my_order_activ': '✅Активен',
    'downgrade_the_rating': '👎🏻',
    'increase_the_rating': '👍🏻',

}

LEXICON_RU: dict[str, str] = {
    'performer': '🛠Исполнитель',
    'customer': '👨‍💼Заказчик',
    'cancel': '❌Отмена',
    'сompleted': '✅Выполнен',
    'porter': '🔌Монтажник',
    'electrician': '👷🏼‍♂️Рабочий',
    'plumber': '📺Экранщик',
    'it-professional': '🎉Декоратор',
    'profile': '👤Профиль',
    'my_orders': '📋Мои заказы',
    'search_orders': '📑Поиск заказов',
    'change_status': '🔄Изменить статус',
    'add_order': '➕Создать заказ',
    'resume': '➡️Продолжить',
    'back_date_order': '🔙Назад',
}

PAGE = {'backward': '◀️',
           'forward': '▶️',
        'back': '↩️Назад',
       }
